background/0.orig/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(left_1|bottom_1|right_3|bottom_3|left_4|right_4|bottom_4)"
    {
        type            zeroGradient;
    }
    "(top_1|top_2|top_3|top_4|bottom_2|right_1|left_2|right_2|left_3)"
    {
        type            zeroGradient;
    }
    movingObject
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
