background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs {}

solver          multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
    movingZone
    {
        // 다른 motion 옵션은 주석 처리되어 있음.
        // solidBodyMotionFunction linearMotion;
        // velocity (0 10 0);

        /*solidBodyMotionFunction oscillatingLinearMotion;
        oscillatingLinearMotionCoeffs
        {
            amplitude       (0 5 0); // displacement
            omega           5;        // velocity
        }*/

        // 순수 평행 이동을 외부 파일에서 지정하기 위해 tabulated6DoFMotion 사용:
        solidBodyMotionFunction    tabulated6DoFMotion;
        tabulated6DoFMotionCoeffs
        {
            CofG             (0 0 0);
            timeDataFileName "$FOAM_CASE/constant/movingZone.dat";
        }
    }
}

// ************************************************************************* //