background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// 크기 | 메쉬 는 10배

//예를 들어 델타 x가 10이면 메쉬사이즈는 10 -> 0.1m
//refine 을 2단계 진행할 예정. 0.1m -> 0.05m -> 0.025m

// Block 1
X1_0    -5;
Y1_0    0;
Z1_0    -0.001;
X1_1    -0.8;
Y1_1    15;
Z1_1    0.001;

nx1     41;
ny1     150;
nz1     1;

// Block 2
X2_0    -0.8;
Y2_0    0;
Z2_0    -0.001;
X2_1    0.8;
Y2_1    15;
Z2_1    0.001;

nx2     31;
ny2     300;
nz2     1;

// Block 3
X3_0   0.8;
Y3_0    0;
Z3_0    -0.001;
X3_1    5;
Y3_1    15;
Z3_1    0.001;

nx3     41;
ny3     150;
nz3     1;

// Block 4 (generator region)
X4_0    -0.8;
Y4_0    -1.8;
Z4_0    -0.001;
X4_1    0.8;
Y4_1    0;
Z4_1    0.001;

//X: -2~2

nx4     31;
ny4     36;
nz4     1;

vertices
(
    // Block 1
    ($X1_0 $Y1_0 $Z1_0)
    ($X1_1 $Y1_0 $Z1_0)
    ($X1_1 $Y1_1 $Z1_0)
    ($X1_0 $Y1_1 $Z1_0)
    ($X1_0 $Y1_0 $Z1_1)
    ($X1_1 $Y1_0 $Z1_1)
    ($X1_1 $Y1_1 $Z1_1)
    ($X1_0 $Y1_1 $Z1_1)
    
    // Block 2
    ($X2_0 $Y2_0 $Z2_0)
    ($X2_1 $Y2_0 $Z2_0)
    ($X2_1 $Y2_1 $Z2_0)
    ($X2_0 $Y2_1 $Z2_0)
    ($X2_0 $Y2_0 $Z2_1)
    ($X2_1 $Y2_0 $Z2_1)
    ($X2_1 $Y2_1 $Z2_1)
    ($X2_0 $Y2_1 $Z2_1)

    // Block 3
    ($X3_0 $Y3_0 $Z3_0)
    ($X3_1 $Y3_0 $Z3_0)
    ($X3_1 $Y3_1 $Z3_0)
    ($X3_0 $Y3_1 $Z3_0)
    ($X3_0 $Y3_0 $Z3_1)
    ($X3_1 $Y3_0 $Z3_1)
    ($X3_1 $Y3_1 $Z3_1)
    ($X3_0 $Y3_1 $Z3_1)

    // Block 4 (generator region)
    ($X4_0 $Y4_0 $Z4_0)
    ($X4_1 $Y4_0 $Z4_0)
    ($X4_1 $Y4_1 $Z4_0)
    ($X4_0 $Y4_1 $Z4_0)
    ($X4_0 $Y4_0 $Z4_1)
    ($X4_1 $Y4_0 $Z4_1)
    ($X4_1 $Y4_1 $Z4_1)
    ($X4_0 $Y4_1 $Z4_1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)       ($nx1 $ny1 $nz1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15)   ($nx2 $ny2 $nz2) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) ($nx3 $ny3 $nz3) simpleGrading (1 1 1)
    hex (24 25 26 27 28 29 30 31) ($nx4 $ny4 $nz4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // Block 1
    left_1
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right_1
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    frontAndBack_1
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
    top_1
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom_1
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    // Block 2
    left_2
    {
        type patch;
        faces
        (
            (8 12 15 11)
        );
    }
    right_2
    {
        type patch;
        faces
        (
            (9 10 14 13)
        );
    }
    frontAndBack_2
    {
        type empty;
        faces
        (
            (8 11 10 9)
            (12 13 14 15)
        );
    }
    top_2
    {
        type patch;
        faces
        (
            (11 15 14 10)
        );
    }
    bottom_2
    {
        type patch;
        faces
        (
            (8 9 13 12)
        );
    }

    // Block 3
    left_3
    {
        type patch;
        faces
        (
            (16 20 23 19)
        );
    }
    right_3
    {
        type wall;
        faces
        (
            (17 18 22 21)
        );
    }
    frontAndBack_3
    {
        type empty;
        faces
        (
            (16 19 18 17)
            (20 21 22 23)
        );
    }
    top_3
    {
        type patch;
        faces
        (
            (19 23 22 18)
        );
    }
    bottom_3
    {
        type wall;
        faces
        (
            (16 17 21 20)
        );
    }

    // Block 4 (generator region)
    left_4
    {
        type wall;
        faces
        (
            (24 28 31 27)
        );
    }
    right_4
    {
        type wall;
        faces
        (
            (25 26 30 29)
        );
    }
    frontAndBack_4
    {
        type empty;
        faces
        (
            //(24 25 29 28)  // y = -20 면
            //(27 26 30 31)  // y = 0 면
            (24 27 26 25)
            (28 29 30 31)
        );
    }
    top_4
    {
        type patch;
        faces
        (
            (27 31 30 26)
        );
    }
    bottom_4
    {
        type wall;
        faces
        (
            (24 25 29 28)
        );
    }
);

mergePatchPairs
(
    (right_1 left_2)
    (right_2 left_3)
    (bottom_2 top_4) 
);
// ************************************************************************* //
